# Kaggle Competition

## Import libraries

In [46]:
%matplotlib inline

import pandas as pd
import numpy as np
import warnings
import pylab as plt
import seaborn as sns
warnings.filterwarnings("ignore")
pd.set_option('display.max_columns', None)
import kaggle

1. EDA
2. Transformar datos
3. Train test split
    1. Evaluar, calcular RMSE
4. Modelar
5. Reentrenar con todos los datos (salaries, sin train test split)
6. Predicci√≥n y subida
7. Comparar Public Kaggle con los resultados del train test split

## Import data

In [10]:
%cd D:\IRONHACK\labs_projects\Projects\Kaggle-Data-Science-Predictor\data

D:\IRONHACK\labs_projects\Projects\Kaggle-Data-Science-Predictor\data

In [13]:
!kaggle competitions download -c predict-the-salary-for-data-science-jobs

Downloading predict-the-salary-for-data-science-jobs.zip to D:\IRONHACK\labs_projects\Projects\Kaggle-Data-Science-Predictor\data

El sistema no puede encontrar la ruta especificada.

  0%|          | 0.00/7.58k [00:00<?, ?B/s]
100%|##########| 7.58k/7.58k [00:00<00:00, 7.78MB/s]

In [15]:
import shutil
shutil.unpack_archive('predict-the-salary-for-data-science-jobs.zip', 'D:\IRONHACK\labs_projects\Projects\Kaggle-Data-Science-Predictor\data\old_data')

In [19]:
%cd ..

D:\IRONHACK\labs_projects\Projects\Kaggle-Data-Science-Predictor

### 1. EDA

- salaries_data.csv

 + se puede borrar columnas, filas, etc
 + entrenar (X/Y)
 + x train / x split

- test.csv

 + NO se borran **FILAS**

In [100]:
salaries= pd.read_csv('data/old_data/salaries_data.csv')
test = pd.read_csv('data/old_data/test.csv')

### Salaries

In [101]:
salaries.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2022,SE,FT,Data Engineer,140250,USD,140250,US,100,US,M
1,2022,SE,FT,Data Engineer,135000,USD,135000,US,100,US,M
2,2021,MI,FT,BI Data Analyst,100000,USD,100000,US,100,US,M
3,2021,MI,CT,ML Engineer,270000,USD,270000,US,100,US,L
4,2021,MI,FT,Data Engineer,22000,EUR,26005,RO,0,US,L

In [102]:
salaries.shape

(500, 11)

In [110]:
salaries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           500 non-null    int64
 1   experience_level    500 non-null    object
 2   employment_type     500 non-null    object
 3   job_title           500 non-null    object
 4   salary              500 non-null    int64
 5   salary_currency     500 non-null    object
 6   salary_in_usd       500 non-null    int64
 7   employee_residence  500 non-null    object
 8   remote_ratio        500 non-null    int64
 9   company_location    500 non-null    object
 10  company_size        500 non-null    object
dtypes: int64(4), object(7)
memory usage: 43.1+ KB

In [109]:
salaries.work_year.value_counts()

2022    263
2021    181
2020     56
Name: work_year, dtype: int64

In [111]:
salaries.experience_level.value_counts()

SE    243
MI    172
EN     65
EX     20
Name: experience_level, dtype: int64

In [112]:
salaries.employment_type.value_counts()

FT    484
PT      8
CT      4
FL      4
Name: employment_type, dtype: int64

In [113]:
salaries.salary_currency.value_counts()

USD    329
EUR     78
GBP     38
INR     23
CAD     16
JPY      3
TRY      3
AUD      2
PLN      2
MXN      1
CHF      1
CLP      1
BRL      1
HUF      1
SGD      1
Name: salary_currency, dtype: int64

In [114]:
salaries.remote_ratio.value_counts()

100    320
0      102
50      78
Name: remote_ratio, dtype: int64

In [115]:
salaries.company_location.value_counts()

US    296
GB     41
CA     25
DE     23
IN     19
FR     12
ES     12
GR     10
JP      4
NL      4
PT      4
LU      3
AE      3
AT      3
PL      3
PK      3
TR      3
CH      2
AU      2
BR      2
NG      2
SI      2
BE      2
MT      1
IR      1
DZ      1
HU      1
CZ      1
HN      1
RO      1
CL      1
EE      1
UA      1
NZ      1
DK      1
CN      1
KE      1
VN      1
MX      1
IE      1
AS      1
MD      1
SG      1
Name: company_location, dtype: int64

In [116]:
salaries.company_size.value_counts()

M    273
L    165
S     62
Name: company_size, dtype: int64

In [117]:
duplicate = salaries[salaries.duplicated()]
duplicate

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
41,2022,SE,FT,Data Scientist,140000,USD,140000,US,100,US,M
133,2022,SE,FT,Data Scientist,140000,USD,140000,US,100,US,M
143,2022,SE,FT,Data Analyst,90320,USD,90320,US,100,US,M
153,2022,SE,FT,Data Analyst,61300,USD,61300,CA,100,CA,M
165,2022,SE,FT,Data Scientist,140000,USD,140000,US,100,US,M
169,2022,SE,FT,Data Engineer,130000,USD,130000,US,100,US,M
196,2022,SE,FT,Data Analyst,99000,USD,99000,US,0,US,M
211,2022,SE,FT,Data Scientist,123000,USD,123000,US,100,US,M
225,2022,SE,FT,Data Engineer,209100,USD,209100,US,100,US,L
227,2022,SE,FT,Data Analyst,130000,USD,130000,CA,100,CA,M
254,2022,SE,FT,Data Analyst,90320,USD,90320,US,100,US,M
270,2022,SE,FT,Data Engineer,165400,USD,165400,US,100,US,M
271,2022,SE,FT,Data Analyst,90320,USD,90320,US,100,US,M
272,2022,MI,FT,Data Engineer,60000,GBP,78526,GB,100,GB,M
276,2022,SE,FT,Data Analyst,90320,USD,90320,US,100,US,M
277,2022,SE,FT,Data Engineer,155000,USD,155000,US,100,US,M
328,2022,SE,FT,Data Analyst,135000,USD,135000,US,100,US,M
337,2022,SE,FT,Data Scientist,123000,USD,123000,US,100,US,M
349,2022,SE,FT,Data Analyst,112900,USD,112900,US,100,US,M
365,2022,SE,FT,Data Scientist,210000,USD,210000,US,100,US,M
371,2022,SE,FT,Machine Learning Engineer,189650,USD,189650,US,0,US,M
398,2022,SE,FT,Data Scientist,140400,USD,140400,US,0,US,L
403,2022,SE,FT,Data Scientist,140000,USD,140000,US,100,US,M
410,2022,SE,FT,Data Engineer,160000,USD,160000,US,100,US,M
413,2022,MI,FT,ETL Developer,50000,EUR,54957,GR,0,GR,M
434,2022,SE,FT,Data Scientist,210000,USD,210000,US,100,US,M
438,2022,SE,FT,Data Analyst,170000,USD,170000,US,100,US,M
447,2022,SE,FT,Data Scientist,210000,USD,210000,US,100,US,M
478,2022,SE,FT,Data Analyst,100000,USD,100000,US,100,US,M
480,2022,SE,FT,Data Analyst,112900,USD,112900,US,100,US,M
485,2021,MI,FT,Data Scientist,76760,EUR,90734,DE,50,DE,L
487,2021,MI,FT,Data Engineer,200000,USD,200000,US,100,US,L
488,2022,SE,FT,Data Scientist,140000,USD,140000,US,100,US,M
495,2022,SE,FT,Data Engineer,100000,USD,100000,US,100,US,M

In [118]:
salaries.drop_duplicates(keep=False,inplace=True)

In [119]:
nan_cols=salaries.isna().sum()

nan_cols[nan_cols>0]

Series([], dtype: int64)

+ Se quitan los duplicados
+ No hay nulos
+ SOLO HAY QUE SELECCIONAR LOS QUE SEAN SALARY USD

In [122]:
salaries = salaries[salaries['salary_currency']=='USD']

In [124]:
salaries.shape

(278, 11)

In [129]:
salaries.to_csv(path_or_buf='data/model_data/salaries_USD.csv', sep=',')

In [137]:
salaries.work_year.value_counts()

2022    155
2021     94
2020     29
Name: work_year, dtype: int64

In [138]:
salaries.experience_level.value_counts()

SE    152
MI     80
EN     33
EX     13
Name: experience_level, dtype: int64

In [139]:
salaries.employment_type.value_counts()

FT    267
CT      4
FL      4
PT      3
Name: employment_type, dtype: int64

In [140]:
salaries.salary_currency.value_counts()

USD    278
Name: salary_currency, dtype: int64

In [141]:
salaries.remote_ratio.value_counts()

100    201
0       57
50      20
Name: remote_ratio, dtype: int64

In [142]:
salaries.company_location.value_counts()

US    246
CA      5
AE      3
PK      3
NG      2
VN      1
IR      1
GB      1
BR      1
RO      1
JP      1
NL      1
HN      1
FR      1
DZ      1
KE      1
CZ      1
MD      1
LU      1
UA      1
NZ      1
CN      1
ES      1
GR      1
Name: company_location, dtype: int64

------------------------------------------

### Test Data

In [130]:
test.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,employee_residence,remote_ratio,company_location,company_size
0,2020,SE,FT,Machine Learning Scientist,260000,USD,JP,0,JP,S
1,2020,MI,FT,Lead Data Analyst,87000,USD,US,100,US,L
2,2020,MI,FT,Data Analyst,85000,USD,US,100,US,L
3,2020,MI,FT,Machine Learning Engineer,299000,CNY,CN,0,CN,M
4,2020,MI,FT,Product Data Analyst,450000,INR,IN,100,IN,L

In [131]:
test.shape

(107, 10)

In [132]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 107 entries, 0 to 106
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           107 non-null    int64
 1   experience_level    107 non-null    object
 2   employment_type     107 non-null    object
 3   job_title           107 non-null    object
 4   salary              107 non-null    int64
 5   salary_currency     107 non-null    object
 6   employee_residence  107 non-null    object
 7   remote_ratio        107 non-null    int64
 8   company_location    107 non-null    object
 9   company_size        107 non-null    object
dtypes: int64(3), object(7)
memory usage: 8.5+ KB

In [133]:
nan_cols=test.isna().sum()

nan_cols[nan_cols>0]

Series([], dtype: int64)

In [134]:
test.work_year.value_counts()

2022    55
2021    36
2020    16
Name: work_year, dtype: int64

In [135]:
test.experience_level.value_counts()

MI    41
SE    37
EN    23
EX     6
Name: experience_level, dtype: int64

In [136]:
test.employment_type.value_counts()

FT    104
PT      2
CT      1
Name: employment_type, dtype: int64

corr = test.corr()
corr.style.background_gradient(cmap='coolwarm')

# TEST MODEL WITH NUMERIC DATA

In [77]:
!pip install h2o

Collecting h2o
  Downloading h2o-3.36.1.3.tar.gz (177.0 MB)
     -------------------------------------- 177.0/177.0 MB 2.3 MB/s eta 0:00:00
  Preparing metadata (setup.py): started
  Preparing metadata (setup.py): finished with status 'done'
Requirement already satisfied: requests in d:\programas\miniconda3\envs\kaggle\lib\site-packages (from h2o) (2.28.1)
Collecting tabulate
  Downloading tabulate-0.8.10-py3-none-any.whl (29 kB)
Collecting future
  Using cached future-0.18.2.tar.gz (829 kB)
  Preparing metadata (setup.py): started
  Preparing metadata (setup.py): finished with status 'done'
Requirement already satisfied: certifi>=2017.4.17 in d:\programas\miniconda3\envs\kaggle\lib\site-packages (from requests->h2o) (2022.6.15)
Requirement already satisfied: urllib3<1.27,>=1.21.1 in d:\programas\miniconda3\envs\kaggle\lib\site-packages (from requests->h2o) (1.26.9)
Requirement already satisfied: charset-normalizer<3,>=2 in d:\programas\miniconda3\envs\kaggle\lib\site-packages (from requests->h2o) (2.0.4)
Requirement already satisfied: idna<4,>=2.5 in d:\programas\miniconda3\envs\kaggle\lib\site-packages (from requests->h2o) (3.3)
Building wheels for collected packages: h2o, future
  Building wheel for h2o (setup.py): started
  Building wheel for h2o (setup.py): finished with status 'done'
  Created wheel for h2o: filename=h2o-3.36.1.3-py2.py3-none-any.whl size=177103819 sha256=377f62bacdcc83f4bdc6ac357ddcda31485d0b6711a7d5d0c73a0763a0826184
  Stored in directory: c:\users\irene aguerri\appdata\local\pip\cache\wheels\c8\f4\37\524d394a841d37aaff472a79755211acceca66d3d5621c9727
  Building wheel for future (setup.py): started
  Building wheel for future (setup.py): finished with status 'done'
  Created wheel for future: filename=future-0.18.2-py3-none-any.whl size=491070 sha256=a87edbfc450a3b583e57440f62c9ce5b4664907a73e890eba63b6af482ced199
  Stored in directory: c:\users\irene aguerri\appdata\local\pip\cache\wheels\22\73\06\557dc4f4ef68179b9d763930d6eec26b88ed7c389b19588a1c
Successfully built h2o future
Installing collected packages: tabulate, future, h2o
Successfully installed future-0.18.2 h2o-3.36.1.3 tabulate-0.8.10

El sistema no puede encontrar la ruta especificada.

In [75]:
numericos = salaries._get_numeric_data()

In [76]:
numericos.head()

   work_year  salary  salary_in_usd  remote_ratio
0       2022  140250         140250           100
1       2022  135000         135000           100
2       2021  100000         100000           100
3       2021  270000         270000           100
4       2021   22000          26005             0

In [ ]:
X_train = numericos.drop()

In [ ]:
from sklearn.model_selection import train_test_split as tts  # el alias es cosa mia


X_train, X_test, y_train, y_test = tts(X, y, train_size=0.8, test_size=0.2, random_state=42)

X_train.shape, X_test.shape, y_train.shape, y_test.shape

### 2. Transform data

### 3. Train test split

### 4. Model